[
    ["What is the service charge of -5.95 taken out my account recently?", "CHARGES"],
    ["I have a question about Albert Savings: I am having problem with my Albert saving", "SAVING"],
    ["Should I get the southwest credit card", "DEBT"],
    ["Wondering if it's terrible that I keep going out to $50-75 dollar dinners when I'm this much in debt.  I couldn't link all my accounts so maybe hard to see from your end.", "ACCOUNT_LINKING"],
    ["How much money should I be saving a month?", "SAVING"],
    ["Why was money taken out of my checking account I didn't authorize that", "CHARGES"],
    ["Buy vs lease a vehicle, what's better money saving wise", "FINANCIAL_PLANNING"],
    ["What would we get with the pet insurance? My girlfriend wanted to know about it and I would like to get some more info on it, please?", "INSURANCE"],
    ["How do you feel about the Uber credit card", "DEBT"],
    ["My monthly insurance payment went down", "INSURANCE"],
    ["The app has my old insurance payment amount and to make an accurate budget I need to change it or delete that bill and replace it with a recent one. How do I do this", "BUDGET"],
    ["Hey i noticed that you took $66 out my account without my consent", "CHARGES"],
    ["Yeah I'm going to have to find a new app. You guys are literally no help. I've tried at least 20 different times to add my acct and it keeps crashing on me. I went to you guys and you just tell me that I'm using the incorrect credentials when that is not the case, I've triple checked. Then you guys say I have to wait 72 hours before I can try again. It's 2018, wtf kind of of shit is this. Thanks for taking my information just to not help in any way.", "ACCOUNT_LINKING"],
    ["I need help working on my debt", "DEBT"],
    ["Should I show credit card payments and mortgage as bills on Albert", "DEBT"],
    ["Does the rainy day fund earn interest?", "SAVING"],
    ["How does it show in the app when I put money in my savings at evergreen", "SAVING"],
    ["So I had asked you guys how I could pay down my credit card debt in the next 6-8 months and I really just wanted to guide you toward a number.", "DEBT"],
    ["Why are you guys charging me 66$", "CHARGES"],
    ["I connected the other account but it's still not working", "ACCOUNT_LINKING"],
    ["I can't access my account.", "APP_GENERAL"],
    ["I want to know how to start working down my credit card debt", "DEBT"],
    ["Hi Albert, I would like to know how to get a quote for a loan to pay my credit cards. Please let me know if asking for this will affect my credit.", "DEBT"],
    ["I need my money transferred back to my checking account", "CASH_TRANSFER"],
    ["How much is a good down payment for a car", "FINANCIAL_PLANNING"],
    ["Is it possible to see what I'm getting charged with every month? Ex: insurance, Netflix, apps, etc?", "CHARGES"],
    ["I'd like to update my monthly price to $1", "CHARGES"],
    ["Is there a way to get my utilities lowered?", "BILLS"],
    ["Do you support reliant federal credit union", "ACCOUNT_LINKING"],
    ["How much should I say to go to New Jersey Save* gas, food, and Souvenirs", "SAVING"],
    ["How do i cancel a transfer?", "CASH_TRANSFER"],
    ["This is likely going to cause an overdraft fee as I don't have enough in my account to cover charges. I will let you know once it processes so y'all can refund it.", "CHARGES"],
    ["I need to spend under $150 a week", "SPENDING"],
    ["I have a question about Albert Savings: I need help cancelling a deposit", "CASH_TRANSFER"],
    ["What is Albert savings?", "SAVING"],
    ["I need a budget plan", "BUDGET"],
    ["How many subscriptions am I paying per month?", "BILLS"],
    ["Hello, I am going to delete my account and would like a refund of the $6 I got charged.", "CANCELLATION"],
    ["Why am I being charged $5", "CHARGES"],
    ["Why did I get charged $66.00 from you guys", "CHARGES"],
    ["I'm having a hard time connecting my student loans, are Sallie Mae loans supported on the app?", "ACCOUNT_LINKING"],
    ["How can I save up to buy a home?", "FINANCIAL_PLANNING"],
    ["Can you take out savings on Thursday's", "SAVING"],
    ["Money is being taken out of my account even though it is paused. There is also no record of the money being taken out in my app", "CASH_TRANSFER"],
    ["Hello do I get charged 5 dollars monthly for my Albert service?", "CHARGES"],
    ["Albert how much are all of my bills total", "BILLS"],
    ["So I've saved 105 dollars so far? Which means you guys act as a bank of sorts?", "SAVING"],
    ["I don't have that much left over at the end of the month That's my income before taxes...I actually bring home $3000 a month and that is close to accurate for the bills give or take a $150", "FINANCIAL_PLANNING"],
    ["Here is the breakdown of my bills and income for December (the bills Can also be applied to January once we figure out December)", "BUDGET"],
    ["Where is the best place to get a small business loan with a co-signer with credit score of 750?", "DEBT"],
    ["Why does my November income not show up? My income is now there but non of my November spending transactions are.", "BUDGET"],
    ["I didn't know I would be charged after the first month upon downloading this app. I would like to cancel my account", "CANCELLATION"],
    ["Hey, Albert. Can I spend $40 today?", "SPENDING"],
    ["How long will it take to pay off credit card?", "DEBT"],
    ["How can I cut down on spending and add to my savings?", "BUDGET"],
    ["Find cheaper car insurance?", "INSURANCE"],
    ["11.9% APR is the interest rate on my credit card. I am unsure of what my current credit score is, do you have a recommended site to find this that will not impact my score?", "DEBT"],
    ["I can't remember my user name", "APP_GENERAL"],
    ["Hi, I withdrew funds from Albert the other day and today the 27th it says that the money was withdrawn from my account however I don't see that it was added to my bank account", "CASH_TRANSFER"],
    ["How much should I pay for someone to clean my 1200 sq ft 2 bed 2 bath apartment in east norriton, Pennsylvania?", "FINANCIAL_TIPS"],
    ["Can I get waba grill?", "SPENDING"],
    ["I don't have this app anymore and I don't want to be charged for something I don't use. How to I get that taken care of", "CHARGES"],
    ["Hi! For the goal I set, does Albert automatically move money into it or do I need to do that myself?", "SAVING"],
    ["I see there is a charge for $66 on my debit card but I don't see anything about it in the app. What was this charge for?", "CHARGES"],
    ["How can I save money? our total monthly bills total out to about $400-$500", "SAVING"],
    ["Hello I checked my bank statements and 50 got withdrawn from my initial deposit and then 55 today. But It doesn't show on the app only in my bank statements", "CASH_TRANSFER"],
    ["Can I link another card to it and y'all give it back that way would it be less trouble", "ACCOUNT_LINKING"],
    ["Hey can you help me save? I want to save 600 by July. I want to go visit my aunt at Seattle.", "SAVING"],
    ["I want to cancel my planet fit gym membership on my chase account.", "BILLS"],
    ["Is there a way to make categories on the Albert application? This way I can see where exactly I'm wanting to budget my money?", "BUDGET"],
    ["How do I cancel automatic savings", "SAVING"],
    ["How do shut off the payment. You guys pulled 4$ the. 1$ and my account is already in the negative. I thought you guys looked out for that?????", "CHARGES"],
    ["Can I afford a $5000 loan", "DEBT"],
    ["How do i Change monthly pricing", "CHARGES"],
    ["I want to be able to pay off my credit cards but still have money left over for food shopping etc..", "DEBT"],
    ["Can i afford McDonald's", "SPENDING"],
    ["What is the 66 dolllers you took out of my account?", "CHARGES"],
    ["How much will be taken out of my account for my \"rainy day\" savings", "SAVING"],
    ["Hey Albert can you cancel any of my monthly subscriptions", "BILLS"],
    ["Does my rainy day fund get transferred to my actual savings account?", "SAVING"],
    ["Can you give me a list of all my recurring subscriptions?", "BILLS"],
    ["Hi! I'm not sure my budget is formulated correctly- I only pay half of my cell phone and car insurance. Is this something you can help me with?", "BUDGET"],
    ["i deleted my account and money is being taken out", "CANCELLATION"],
    ["How do i save more weekly ?", "SAVING"],
    ["Hey Genius! How do I start investing?", "INVESTING"],
    ["Hi, I was wondering, do you think it's a good idea for me to buy a house around summer 2019 given my debt and credit score?", "FINANCIAL_PLANNING"],
    ["Aye yo Albert, it keeps saying I have 700 dollars of expenses. I only have 350 expenses a month. I keep deleting the extra 350 one but it keep re appearing", "BUDGET"],
    ["What is the best way for me to reduce me debt", "DEBT"],
    ["You just took $66 from my account what was that for", "CHARGES"],
    ["Hi I want to pay off my credit card debt as fast as possible", "DEBT"],
    ["Where can I cut spending", "BUDGET"],
    ["What are my subscriptions?", "BILLS"],
    ["Hello there, I'm interested in make a less monthly payment for my car loan. Could you please help me?", "DEBT"],
    ["I need to have about $200 saved by February 2nd,  and another $200 by March 23. How much should I start saving now?", "SAVING"],
    ["Why did you take $55 from my checking account today ?", "CHARGES"],
    ["Why did Albert take $66.00 out", "CHARGES"],
    ["Hey, Albert your application just charged me $44 and I'd like to know why?", "CHARGES"],
    ["Why haven't I received a bonus?", "APP_GENERAL"],
    ["I'm getting a new job soon. I'll be making 21.50 an hour. How much is that after Tax How much my income should go to my savings ?", "FINANCIAL_PLANNING"],
    ["I want to pay off my credit card balance", "DEBT"],
    ["Can I buy a pizza", "SPENDING"],
    ["hey i wanted to know what payments you all have marked down and how i can further assist to help you all see how much goes to bills monthly", "BILLS"],
    ["Hi, I'm interested in finding ways to improve my credit score while paying off bills with the most interest first.", "DEBT"],
    ["Can I create a budget with Albert?", "BUDGET"],
    ["How can I save money", "SAVING"],
    ["Can I afford to spend $90 on shondas Masterclass", "SPENDING"],
    ["Can I afford an oil change this next paycheck?", "BUDGET"],
    ["I got money pulled out of my account. I need a refund. ", "CHARGES"],
    ["What's my spending?", "SPENDING"],
    ["Hey there! Can you tell me how much I spent at Starbucks this month compared to last month please? ", "SPENDING"],
    ["Can I spend anymore money", "SPENDING"],
    ["Are you able to tell me who's auto charging my bank account?", "BILLS"],
    ["I did not agree tho this, I was told I would have a free month and could cancel at anytime. I want a full refund and there are more charges to my account than just the $66 which by the way I got an overdraft fee for you taking out ", "CHARGES"],
    ["How much money can I save by not going to Starbucks ", "SAVING"],
    ["I would like to cancel my Albert account because I don't have an iPhone anymore so can't use the app anymore ", "CANCELLATION"],
    ["20 dollars was taken out of my account and not in my saving, where are the 20.00 that were removed  ", "SAVING"],
    ["Where can I cut spending ", "BUDGET"],
    ["Who is auto charging my bill?", "BILLS"],
    ["I can't link my Chase account", "ACCOUNT_LINKING"],
    ["Can I not take money out of my saved goal?", "SAVING"],
    ["Are they any suggestions you would make as far as saving and all around just being smarter with my finances?", "SAVING"],
    ["Are you available like the to ask if I can afford a purchase before I do it?", "SPENDING"],
    ["Albert, can I afford to buy new shoes", "SPENDING"],
    ["How do I send money from my savings to another account ", "SAVING"],
    ["Can I get car insurance? ", "INSURANCE"],
    ["What bills an I'm paying? ", "BILLS"],
    ["I want to find a good travel rewards card. I will use it mostly for flier miles.", "DEBT"],
    ["Hello, I am currently looking for an apartment to rent. Can I afford $800.00 a month as my share of the rental? ", "SPENDING"],
    ["I want to buy an apartment", "FINANCIAL_PLANNING"],
    ["I was overdraft by several items, Albert was one. It was 25.00 for the transaction and 36.00 for the overdraft.", "CHARGES"],
    ["Can I change my savings to manual transfer please", "CASH_TRANSFER"],
    ["Can I get my money back please and can I cancel this account?", "CANCELLATION"],
    ["I want to pay off my credit card bills", "DEBT"],
    ["Hello can I get you to confirm that I did not authorize Albert to remove 355 from bank account on 11/23. My bank needs your confirmation in order to close the case", "CHARGES"],
    ["I have a question about Albert Savings: I've had some money deposited into my bank account and I am trying to put it into my savings but it won't let me ", "CASH_TRANSFER"],
    ["Hey Albert, can you help me find information about buying a new car?", "FINANCIAL_PLANNING"],
    ["When you start to take my 25$ every weekend for savings am I still able to use those funds on my debit card ?", "SAVING"],
    ["Hi there, I didn't realize I had a $10 investment set up and it removed the $10 from my bank of account. Is there a way to get those deposited back into my bank account. ", "CASH_TRANSFER"],
    ["How much money do I have to spend this month ", "BUDGET"],
    ["Hi I'm trying to finish setting up Albert and I'm at the step where it says type the amount deposited into my account but I don't see anything in my account and it won't let me type ", "CASH_TRANSFER"],
    ["Why was I charged for my account ", "CHARGES"],
    ["I had deleted my Albert app and it took money out of my account when I did not want it to. Please refund my $10.00 immediately. ", "CANCELLATION"],
    ["About how much money do I spend on food every month?", "SPENDING"],
    ["You made my bank account go negative with the savings you withdrew and now I'm going to get an overdraft charge. Put it back into my account please ", "CHARGES"],
    ["How does smart saving work?", "SAVING"],
    ["How can I tell from Albert when it's been withdrawn from my account", "CASH_TRANSFER"],
    ["How should I be contributing to my employer's 401k if I have debt of $13,500. They match 100% of the first 2% and then 50% up to 6%. Should I be contributing more than 6% yet?", "DEBT"],
    ["I still haven't received my refund of $66", "CHARGES"],
    ["I need to find a way to really pay down my credit card? How can I budget to do this?", "DEBT"],
    ["What's the best way to get my credit started? ", "DEBT"],
    ["Albert, can I afford to get my nails done?", "SPENDING"],
    ["Is saving to buy a house an option ", "FINANCIAL_PLANNING"],
    ["What are my subscriptions?", "BILLS"],
    ["I don't have any student loans, but I do have an outstanding bill of $3,000 with a college. Is there a place to record that in the app?", "DEBT"],
    ["Where is the money going that is taken out of my account?", "CASH_TRANSFER"],
    ["What subscriptions am I currently paying for? ", "BILLS"],
    ["What was my 55$ charge for?", "CHARGES"],
    ["Good morning, funds were taken from my bank account on Monday 11/26 to be applied to my rainy day fund and have cleared my account but are not present in the Albert app. ", "SAVING"],
    ["This has been done multiple times. The deposit made November 26 is not showing. It was pending on the app and then disappeared but was never added to the balance but was deducted from my bank account. Is there a chance that the deposit from the 22nd did not hit my account until the 26th due to thanksgiving? It may have been delayed", "CASH_TRANSFER"],
    ["How to stop spending on eating out", "SPENDING"],
    ["How much should I be spending per month on bars ", "SPENDING"],
    ["Can I set up a budget in the app", "BUDGET"],
    ["Hey Albert, how can I start paying off my credit card debt wisely? ", "DEBT"],
    ["What bills will I have on the 1st?", "BILLS"],
    ["Can I add bills that I pay with cash?", "BILLS"],
    ["My name is Melanie and I had signed up for your account about 2 weeks ago. I had signed up for a weekly billing but was charged an annual billing of 55 dollars. I had asked for a refund and was  going to be granted one but I have not heard or seen anything. If I could just please have an update on when I will have this refund please, thank you.", "CHARGES"],
    ["Why am I not saving $25 a week? ", "SAVING"],
    ["how much will my income tax be?", "FINANCIAL_PLANNING"],
    ["I need to save $10,000 for when i move to colorado next august", "SAVING"],
    ["What the most affordable gym in the greater New Orleans area?", "SPENDING"],
    ["Automatic savings transfer?", "CASH_TRANSFER"],
    ["Imagine my surprise when my account had been devoted $66.00 for the app. I was just checking it out to see if it's something I wanted to do. When I decid", "CHARGES"],
    ["Hi Albert, can we stop taking money out of my bank account for my savings until after I pay rent", "SAVING"],
    ["Hey there. I have over 1,600 in credit card debt that I need to pay off as quickly as possible because I will be switching banks soon (I'm moving from FL to IL). Any tips?", "DEBT"],
    ["Why is Albert genius charging me?", "CHARGES"],
    ["Is there any way I can cancel my subscription and account to Albert?", "CANCELLATION"],
    ["Has Albert added any card compatibility with the Ally Cashback Credit Card yet?", "ACCOUNT_LINKING"],
    ["I just transferred money from the app to my bank account. But now there is showing a $6 charge. What is this for? ", "CHARGES"],
    ["What are my reoccurring expenses ", "BUDGET"],
    ["Can I add credit cards and bill", "DEBT"],
    ["Greetings. I am looking for perspective(s) on the best ways to engage with a reoccurring withdrawal. ", "CASH_TRANSFER"],
    ["Hi there, can I get advice on paying down student debt?", "DEBT"],
    ["Where did that $55 go? ", "CHARGES"],
    ["Can I afford a 900$ mortgage", "DEBT"],
    ["I want to shut off the automatic withdrawals from Albert until after the holidays. How do I do that?", "CASH_TRANSFER"],
    ["How can I save money? ", "SAVING"],
    ["If I start savings with your app how will it transfer to my bank account", "CASH_TRANSFER"],
    ["How do I really start paying off my debt?", "DEBT"],
    ["Can I not use Albert genius and not pay a monthly fee", "CHARGES"],
    ["How many monthly subscriptions do I have ? ", "BILLS"],
    ["What are my bills for next month ", "BILLS"],
    ["I pay my bills in cash how do I note that ", "BILLS"],
    ["Hey Albert. What expense can I stop to save more money?", "SAVING"],
    ["Hi- What's an easy way to save for rent during the month?", "SAVING"],
    ["Hello my name is Ricardo clarke I don't use your service But I see where you took $9 and them $11 from my account please stop and please refund my money ricardoclarke5526@gmail.com", "CHARGES"],
    ["Cancel Hulu ", "BILLS"],
    ["Hi how do I remove my savings from the Albert account ", "SAVING"],
    ["Am I able to link my Stash investment account? It's added manually now but I'd like it to be automatic", "ACCOUNT_LINKING"],
    ["What subscriptions do I have right now?", "BILLS"],
    ["Do I have money for Juul pods", "SPENDING"],
    ["For saving I send it to you and it just stays saved and can I use it whenever I want?", "SAVING"],
    ["How much is my next paycheck", "BUDGET"],
    ["Albert I need to pay off my credit cards ", "DEBT"],
    ["Why isn't my rent added into my bills", "BILLS"],
    ["What's my balance in my chase account? ", "BUDGET"],
    ["Help set a budget is a good one", "BUDGET"],
    ["I am able to pay rent using credit are with a 30 dollar fee. Are there any credit cards that would be worth this fee ?", "DEBT"],
    ["Hey Albert, based on my activity last month, what expenses do I have coming up?", "BUDGET"],
    ["How likely is it I can get approved for a 250,000$ loan for a first time home?", "DEBT"],
    ["Hello, what would I need to pay every month toward my credit to get it paid off quickly? ", "DEBT"],
    ["Hey Albert why was I charged $55? ", "CHARGES"],
    ["If I buy a $500 AR-15 how much money will I have saved by January 1st?", "SAVING"],
    ["How much can I spend on Christmas gifts?", "SPENDING"],
    ["I pay rent with cash and I want to add it to my recurring bills. How do I do that?", "BILLS"],
    ["Need some advice on creating an effective budget.", "BUDGET"],
    ["Can I afford dinner tonight?", "SPENDING"],
    ["Did not authorize my account to be charged I want a full refund ", "CHARGES"],
    ["Can you pause Albert savings until after the 6th of December?", "CASH_TRANSFER"],
    ["So I need a car...best driving record haha Well I will soon have to pay insurance starting next year so I don't know if it would be cheaper to do that or keep to Uber. I will say that I don't have the ", "INSURANCE"],
    ["Hello I would assistance linking my bank account. Capital Communication federal credit union", "ACCOUNT_LINKING"],
    ["What would a reasonable monthly budget for food be?", "BUDGET"],
    ["Should I be investing in the stock market?", "INVESTING"],
    ["can I afford lunch ?", "SPENDING"],
    ["can I buy lunch today ? ", "SPENDING"],
    ["Hey, I am really interested in lowering my monthly credit card payments. ", "DEBT"],
    ["Just checking in if the issue with your account aggregation partner has been fixed yet?", "ACCOUNT_LINKING"],
    ["I'm looking at an apartment today. What are some good questions to ask? ", "FINANCIAL_PLANNING"],
    ["My regular deposits are not showing up in transactions ", "CASH_TRANSFER"],
    ["Can I afford to buy a coffee", "SPENDING"],
    ["How much money did I spend in the month of November?", "SPENDING"],
    ["How do I cut back on spending?", "BUDGET"],
    ["I'd love to take all of our credit cards that we're paying interest on and consolidate that to a low interest loan. Would that be a good idea?", "DEBT"],
    ["Can you help me find off the books work?", "FINANCIAL_PLANNING"],
    ["I have a question about Albert Savings: How come in Albert Savings it doesn't evenly divide up the weekly amount among all the goals?", "SAVING"],
    ["I want to get a credit card", "DEBT"],
    ["How do I get a credit card?", "DEBT"],
    ["Where can I cut back? I need money bad. ", "SPENDING"],
    ["I don't know what the dashboard hosting that I'm being billed for.  Do you have any clue what it is and how to stop being charged for it?", "BILLS"],
    ["I have a question about Albert Savings:  I do not use my TD Bank account anymore there was problems with it my new account is chase I would like to have connected I'm trying to deposit money but it is only giving me TD Bank as an option to do it from how do I switch that so I can keep saving as td account is not usable anymore ", "CASH_TRANSFER"],
    ["Can I trade in my car for a truck? I might be $5000. Upside down ? ", "FINANCIAL_PLANNING"],
    ["Looking at options for paying down my credit cards at a better pace. ", "DEBT"],
    ["I was charged 55 dollars from you", "CHARGES"],
    ["Hey Albert! I'm working two jobs and I'm trying to save to get a car sooner than later. right now I'm spending a lot in public transportation and gas for other people giving me rides. Ive recently become a single mom and need to be able to get myself and my daughter around but I don't know if I can afford a good car with my bills and income. Any suggestions ?", "FINANCIAL_PLANNING"],
    ["The verification has been \"in progress\" for a week", "APP_GENERAL"],
    ["Hello! I'm just wonder how much I have in my Albert savings ", "BUDGET"],
    ["How much did I spend on groceries this month ", "SPENDING"],
    ["I'd like to cancel Hulu ", "BILLS"],
    ["I got into an accident and I don't have the money to fix my car.", "FINANCIAL_PLANNING"],
    ["Why was I charged $66", "CHARGES"],
    ["I still cannot get correct account details on my student loans. I am just about done with this.", "DEBT"],
    ["I've tried to link my bank account but says to try again later or use a different account ", "ACCOUNT_LINKING"],
    ["Hi, I was wondering why there is a 66.00 withdraw from my account to you. ", "CHARGES"],
    ["I'm having trouble accessing my account ", "APP_GENERAL"],
    ["What's the best investment strategy for my early 20's.? ", "INVESTING"],
    ["I want to go on a trip to Costa Rica. How much can I spend on tickets? ", "SPENDING"],
    ["I'm being charged 4$ per month. Why?", "CHARGES"],
    ["how much should i spend on entertainment and retail per month? what is the average college student budget, broken down into categories? (food, travel, entertainment, products, retail)", "BUDGET"],
    ["Can I afford lunch for two today?", "SPENDING"],
    ["What is the best robo investing site? ", "INVESTING"],
    ["Morning! Why is Albert taking out more money than I have in my checking account? It overdrew me. Normally my account isn't so low so I am assuming that is why, but doesn't it look at how much I can afford to save vs not save? Thanks for the help", "CHARGES"],
    ["What's my average food spendings per week?", "SPENDING"],
    ["Hi, I recently changed the log in information for my bank and now Albert is having problems connecting. I've tried updating the credentials and am receiving multiple error notices. I'm positive my log in information is correct and have even tried adding the bank again, but then I receive an error once it's finalizing adding the account. ", "ACCOUNT_LINKING"],
    ["Which one is the best credit card?", "DEBT"],
    ["why did you take out $44 out of my account? ", "CHARGES"],
    ["How do I stop the transfers", "CASH_TRANSFER"],
    ["how much can I afford to pay each month toward credit debt?", "DEBT"],
    ["I am looking into consolidating 2 of my student loans (parent plus loans)", "DEBT"],
    ["Hi, I'm not able to add my rent I pay this via cash how do I get to add this to my bills?", "BILLS"],
    ["How can I pay off my credit cards", "DEBT"],
    ["I will try that thank you. I had no idea I spent that money in a month. How do I start a budget.?", "BUDGET"],
    ["How much money can i save if i don't eat fast food", "SAVING"],
    ["I keep trying to log in to my bank account on the app and it keeps telling me I have the wrong credentials even though it's right ", "ACCOUNT_LINKING"],
    ["This has been completed.  I want to pay off credit cards and maintain a budget.  Please help!", "DEBT"],
    ["How do I improve my credit score?", "DEBT"],
    ["How do I set up smart savings on multiple accounts? Right now Albert is only doing one and I want to use 2 checkings ", "SAVING"],
    ["Hi, I need to get a new cell phone. But I'm not quite sure what I can afford. ", "SPENDING"],
    ["I need to lower my monthly bills. I want to save to buy a house. ", "FINANCIAL_PLANNING"],
    ["Can I cancel genius please?", "CANCELLATION"],
    ["How do I budget for Christmas shopping? ", "BUDGET"],
    ["My bank account is no longer linked and I don't understand why??", "ACCOUNT_LINKING"],
    ["Good morning! I would like to pay off my car loan as quickly as possible. Is this possible with my income and bills?", "DEBT"],
    ["Hello, I am in the process of sending the little savings I have in your app back to my account, now I would like to close it. So far, without my bank account linked due to issues on your end with my bank, I'm getting no benefit from keeping this app. Please close my account ", "CANCELLATION"],
    ["Who's auto-charging me ", "BILLS"],
    ["I have a question I see there has been $7 taken for savings. Where does it go. I don't have a saving account ", "SAVING"],
    ["How will you save me money?", "SAVING"],
    ["Hi, I have a charge on my bank account for 55 dollars for an Albert genius account. I never agreed to pay yearly and the signup indicated that my first month would be free. I am trying to close my account as I do not want to use the service and would like to be refunded for this charge I did not agree to. ", "CANCELLATION"],
    ["Hey Albert. So I think I got everything set up pretty well. Where can I start with my current finances and debt to improving my credit? ", "DEBT"],
    ["Can you cancel my membership please ", "CANCELLATION"],
    ["I want to suspend my saving at the moment ", "SAVING"],
    ["Hello- I did not authorize a charge and had one hit", "CHARGES"],
    ["I would like to add my rent to my bills. But I pay in cash, is there anyway I can add", "BILLS"],
    ["I'm looking at buying a house by fall 2019/ winter 2019. I'm looking in the range of $120,000- $165,000. What would be a good amount to save to get a decent down payment ", "FINANCIAL_PLANNING"],
    ["How do we adjust my income? My spending the last three months does not accurately represent the budget i want I would like to add one Venmo transaction into income, but not the others, is that possible", "BUDGET"],
    ["I just want the free version of this", "CHARGES"],
    ["I didn't realize this would be taking money out of my account, it's taken $22 out for this month and I need that put back in my account to pay bills ", "BILLS"],
    ["Yes I would like to cancel this I did not authorize this and $100 was took out of my account ", "CHARGES"],
    ["Are you going to add Light Stream loans to the app? It's a Division of suntrust and I can't log in via the suntrust page ", "ACCOUNT_LINKING"],
    ["Can I afford shoes? ", "SPENDING"],
    ["Hi Albert. I get paid every two weeks. Can I have the app automatically transfer money out for me right when I get paid?", "CASH_TRANSFER"],
    ["Hi! I am having an issue with my account. Recently I've updated my bank account login information. In doing so, it has disconnected Albert. I am attempting to re-connect the two, however it Says my account Login information is wrong. I've proved that it is correct by adding the same account for a valuation but it is not linked for smart saving or otherwise how can I solve this problem?", "SAVING"],
    ["How many credit cards do I have ", "DEBT"],
    ["I'd like to add to the genius list Hi! I'd like to set a mission to get my savings account up to $20k", "SAVING"],
    ["i need help with my monthly budget on the app ", "BUDGET"],
    ["Thank you, how can I get the 700 that I have saved w you guys Have an emergency situation. ", "SAVING"],
    ["What subscriptions can I cancel to cut costs? ", "BILLS"],
    ["Need loan", "DEBT"],
    ["I have a question about Albert Savings: how long does it take once I withdraw, to hit my account?", "CASH_TRANSFER"],
    ["How do I budget myself?", "BUDGET"],
    ["Hey I was wondering why $66 was taken from my bank account and how I can get my money back ", "CHARGES"],
    ["I'm trying to save money but also pay off all my bills as fast as I can ", "SAVING"],
    ["Why did you charge me 66 bucks yesterday ? ", "CHARGES"],
    ["Hi! I've been thinking about getting renters insurance for my apartment but haven't because they don't require it, is it worth it to get? ", "INSURANCE"],
    ["How do I put my Albert's savings back into my bank account ", "SAVING"],
    ["How much did I spend at Walmart in November?", "SPENDING"],
    ["How much did I spend at restaurants in November?", "SPENDING"],
    ["How much have I spent on online shopping this month", "SPENDING"],
    ["How much can I spend each week?", "SPENDING"],
    ["Hey how many subscriptions and I paying for?", "BILLS"],
    ["Okay! How can I improve my credit score? Just pay my interest and my loans on time?", "DEBT"],
    ["I no longer have that account how do I access my funds ", "APP_GENERAL"],
    ["Hello! I don't understand the rainy day fund, is it taking the $20 out of my bank account & putting it in Albert? Or how does that work?", "SAVING"],
    ["What was the 55 dollar for ", "CHARGES"],
    ["What are my subscriptions?", "BILLS"],
    ["Hello, I deleted some savings goals that still had funds in them. Where does the money go? My rainy day fund did not increase so I'm not sure where my money went. Thanks", "SAVING"],
    ["Hello! So I just heard about the possibility of haggling my cell phone and/or cable bill lower and that you can help me with that?", "BILLS"],
    ["Hi. I am in need of a school loan for next semester. And I don't know where to look", "DEBT"],
    ["I can't link my bank account", "ACCOUNT_LINKING"],
    ["Hi. My Albert account decided to start my smart savings with $7 from my bank account that overdrew my account and I was charged almost $40 by my bank for that. ", "CHARGES"],
    ["How can I see my savings chart? It's like a graph showing what I spend my money on Mine says I have no spending history ", "SPENDING"],
    ["I cancelled a savings withdrawal and it still went through, which overdrafted my account again ", "CHARGES"],
    ["Can I afford a $100 pair of shoes", "SPENDING"],
    ["Can I afford to get zaxbys after work ", "SPENDING"],
    ["How can I set up a budget?", "BUDGET"],
    ["How do I cancel genius? I just want the regular Albert ", "CANCELLATION"],
    ["I want to unsubscribe from this please ", "CANCELLATION"],
    ["Is there anyway to save money even with my low income?", "SAVING"],
    ["Hello, I have a question about why this app is still taking money out of my bank account even though I have paused it. It has over drafted my account twice. ", "CHARGES"],
    ["There's been an error with a unauthorized charge of $21 on my account ", "CHARGES"],
    ["I'm having an issue adding my main bank account. It's through Alaska USA. I was able to manually enter my account balances. Does this mean I have to upda", "ACCOUNT_LINKING"],
    ["Cheapest place to get groceries? ", "FINANCIAL_TIPS"],
    ["How much are all my monthly bills combined? ", "BILLS"],
    ["How can I bring down my debt", "DEBT"],
    ["Hello Can't connect my bank account There were security I'm not a robot picture questionnaire  I don't Understand how I could of got them wrong ", "ACCOUNT_LINKING"],
    ["What's the best method to paying off my credit card debt?", "DEBT"],
    ["Albert I've never been able to stay on budget what can I do", "BUDGET"],
    ["Can I afford to go to ny this weekend?", "SPENDING"],
    ["can you change my monthly payment to 1 dollar please?", "APP_GENERAL"],
    ["Hey I want to save money and how enough to go Christmas shopping ", "SAVING"],
    ["Is there a monthly fee to use your services?", "CHARGES"],
    ["What are my subscriptions?", "BILLS"],
    ["I wish to dispute the charges made against me for the past few months ", "CHARGES"],
    ["Is it a good idea to consolidate my credit card payments through a lending company if the interest rate is slightly higher?", "DEBT"],
    ["Where does the money Albert Dave's for me go? Saves*", "SAVING"],
    ["I have a personal debt with my parents, how can I add that to my account?", "DEBT"],
    ["Hi! Can you cancel my \"HIMS\" subscription?", "BILLS"],
    ["how do i add my bills to the app?", "BILLS"],
    ["Can I get a car ", "FINANCIAL_PLANNING"],
    ["What subscriptions do I have on my Amex ", "BILLS"],
    ["How much did I spend this week? ", "SPENDING"],
    ["How much should I save from each check to pay my credit cards off by March? ", "DEBT"],
    ["Can i afford this ?", "SPENDING"],
    ["How do I withdraw from Genius", "CASH_TRANSFER"],
    ["The Albert app just overdrew my checking account on two $25 OD fees. Any idea what that's about? ", "CHARGES"],
    ["What are my monthly subscriptions ", "BILLS"],
    [" Can I afford to buy a 15 dollar movie", "SPENDING"],
    ["What is my balance ", "BUDGET"],
    ["Hello! How much money do I have in my Albert savings ", "BUDGET"],
    ["How can you help me cut down on my monthly bills?", "BILLS"],
    ["Hi so I see on the Albert app it also has one of my checking accounts, which is a certificate that I cannot withdraw from. Will Albert withdraw from that because that will indicate a fee on me?", "CASH_TRANSFER"],
    ["I didn't finish setting this up and I thought because of that I wouldn't get charged weekly for the savings. How do I cancel that ?", "SAVING"],
    ["Hello, I recently upgraded my phone along with a new number. I managed to forget my password and every time I try to reset it I don't get an email. ", "APP_GENERAL"],
    ["How does money keep getting put in savings and other goals but doesn't show up on my bank account?", "SAVING"],
    ["I need to contact customer service", "APP_GENERAL"],
    ["Where do I find atms without fees", "FINANCIAL_TIPS"],
    ["What banks have no fees? Or at least no maintenance fees? ", "FINANCIAL_TIPS"],
    ["Hey Albert. Are you able to help me figure out a good amount to spend on rent ?", "FINANCIAL_PLANNING"],
    ["Hi. I really want to get this issue fixed. I spoke with my back and they aren't showing any restricted access. They recommend unlinking my account and then re entering or   relinking. Can you try that?", "ACCOUNT_LINKING"],
    ["What's the fastest way to paying off my credit card without spending every dime I bring in? ", "DEBT"],
    ["Hello. I saw that the $1,003.17 amount was transferred to my PNC bank account. When can I expect the rest ($34) to be transferred to my bank account?", "CASH_TRANSFER"],
    ["Could I possibly get my $15 in savings refunded back by chance please?", "CHARGES"],
    ["Do I have money to buy Christmas decorations? ", "SPENDING"],
    ["Hi. Do you have opinions about the Uber credit card? I'm considering it as a primary credit card ", "DEBT"],
    ["What do I do to make more money", "FINANCIAL_PLANNING"],
    ["Albert I have a saving account outside of you", "SAVING"],
    ["Ok I actually dont need albert and its not letting me delete the account. I have no transactions pending. How do I go about doing this? ", "CANCELLATION"],
    ["Hey here's my financial to-do list. Hopefully you guys can guide me in the right direction. ", "FINANCIAL_PLANNING"],
    ["I want to save money", "SAVING"],
    ["How do I withdraw money from my account?", "CASH_TRANSFER"],
    ["Thank you for the recommendations to those websites, super useful. I want to create a list of goals... reduce debt, save for closing costs for a house, save for children, save for retirement, save for investment", "FINANCIAL_PLANNING"],
    ["What would be the best way to pay off my credit cards? Do I pay off the ones with higher interest first or the ones with low balances and do the snowball? so if my cards are almost at their limit I should pay those first and then start to snowball? ", "DEBT"],
    ["How can I cut cable? Yes I want to cut my spending see other options", "BUDGET"],
    ["Yes and I reset my password but signing in it's saying I'm suspended ", "APP_GENERAL"],
    ["Can I afford another car?", "FINANCIAL_PLANNING"],
    ["Hello can I link credit card accounts as well?", "ACCOUNT_LINKING"],
    ["Albert. Would it be a good idea to buy a car now? ", "FINANCIAL_PLANNING"],
    ["Hi $55 was taken from Albert but I do not see where it is on my Albert account ", "CHARGES"],
    ["Hi! I'll have to stop saving on Albert for a few months. How can I pause it? And if I pause it will the fee be charged?", "SAVING"],
    ["Can I afford dinner 32.57", "SPENDING"],
    ["I'm estimating my paycheck to be in the $120 range this friday, how much can I afford to spend on gas and my victorias secret bill?", "BUDGET"],
    ["What could I do to save money? ", "SAVING"],
    ["Hello. Can you explain to me why my savings went from $700 to $600.40 without me ever withdrawing from my account", "CASH_TRANSFER"],
    ["How should I budget till payday", "BUDGET"],
    ["how do i set up another savings idea in the app", "SAVING"],
    ["How do you add a transfer from your bank account that you do every month to recurring bills", "CASH_TRANSFER"],
    ["I did not authorize a $150 deduction from my card", "CHARGES"],
    ["What subscriptions do I have?", "BILLS"],
    ["Forgot my username", "APP_GENERAL"],
    ["why did you charge me $6?", "CHARGES"],
    ["How can I withdraw all of my funds not just partial", "CASH_TRANSFER"],
    ["How do I get my savings out and back into my bank account ", "SAVING"],
    ["Can you tell me my goal balances since I don't have the app beta yet?", "SAVING"],
    ["Hi my account was suspended? How do I get it back ?", "APP_GENERAL"],
    ["Can I afford a vacation", "SPENDING"],
    ["I'm trying to make an account but mine won't show up. I tried to use my old account at another bank and I got locked out because I couldn't remember my questions. How can I make an account still?", "APP_GENERAL"],
    ["Is there a way to help reduce debt with bad credit? ", "DEBT"],
    ["How much can i afford to pay for monthly car payments?", "FINANCIAL_PLANNING"],
    ["I have a question about Albert Savings: why isn't my withdrawal going through? It has been more then 7 business days.", "CASH_TRANSFER"],
    ["How long would it take to pay off all of my credit card debt? ", "DEBT"],
    ["Hey I'm thinking about getting a house or my own apartment near May 2019. My income by then is 80k. But with my credit score and everything do you think the bank will give me a mortgage ", "FINANCIAL_PLANNING"],
    ["Hello I received your message back about the Amt I'd be paying. However my bank just got charged 55 from Albert ? ", "CHARGES"],
    ["How can I pay off my credit card", "DEBT"],
    ["Why did Albert take $55 out of my account?", "CHARGES"],
    ["What  am I spending on subscriptions ", "SPENDING"],
    ["Why does my bank act show that a $6 withdraw was made by Albert 11/28 if my account is paused???", "CASH_TRANSFER"],
    ["I have a question about Albert Savings: I withdraw $40 out of my rainy day fund and transferred to my bank account on 11/24. When will the money be available in my bank account ", "SAVING"],
    ["i already said stop saving for me. I want my money back. y'all need to Paypal it to me because I'm not changing my bank password - I'm afraid that you guys will take more money from my account since I already paused saving yet it still took money the first time....", "SAVING"],
    ["Hi! I'd like to make a change to my profile settings for Albert I'd like to change the monthly rate from $5 to $2. I definitely do not use it enough to merit $5/monthly. ", "CHARGES"],
    ["Hello, has there been any progress fixing the issue with my bank?", "ACCOUNT_LINKING"],
    ["I don't know much about Roth IRAs and would like more information. How can I set one up?", "INVESTING"],
    ["Also-- do you know of any student loan forgiveness programs or grants for mental health providers? Or professionals working in non-profits?", "DEBT"],
    ["Hi! I need to return the money that was taken from my account for the savings. How can I do that?", "SAVING"],
    ["Help me consolidate my debt", "DEBT"],
    ["How do I unlink my bank account? ", "ACCOUNT_LINKING"],
    ["Do i have money for a burger?", "SPENDING"],
    ["Do I have to have Albert genius to be able to utilize all that y'all have to offer? I'm going to be super broke after I pay my car, should I go ahead and take 30 out of my savings for gas?", "FINANCIAL_PLANNING"],
    ["Hi, I need to add an account. How do I do it?", "ACCOUNT_LINKING"],
    ["I can't withdraw anything. Will the $150 be deposited into my chase checking account ending in 1212? And if so, when will I see the adjustment? ", "CASH_TRANSFER"],
    ["can you speed up my withdrawal my account got over drafted with albert charge is it possible for me to receive the money today, i requested the withdrawal, i can call the bank to process the money faster if you can make sure that my bank ", "CHARGES"],
    ["How can I lower my bills?", "BILLS"],
    ["Hey I thought my subscription been canceled but I see that you guys withdrew money from my account still", "CANCELLATION"],
    ["Can I afford to spend ", "SPENDING"],
    ["How much can I spend a week ", "SPENDING"],
    ["I have questions Are you going to help me save money ", "SAVING"],
    ["Help me lower my Bills please ", "BILLS"],
    ["I'm locked out of my account", "APP_GENERAL"],
    ["What is the difference between leasing and financing a car ?", "FINANCIAL_PLANNING"],
    ["How do I unlock my bank account to link Wells Fargo?", "ACCOUNT_LINKING"],
    ["Hi! We need help making a budget and sticking to it. Right now we are limited to one income. Can you prioritize necessities in our budget like rent, utilities, etc.?", "BUDGET"],
    ["Should I refinance my student loan?", "DEBT"],
    ["What bills do I have", "BILLS"],
    ["Good morning, Albert! I have a question about home refinance loans and renovations. ", "DEBT"],
    ["I did not want money taken out of my checking account, and I want it to be transferred back", "CASH_TRANSFER"],
    ["How does the monthly payment work? Why is mine $6 but others I know are $4. Does it come out of what's saved or my bank account. Is there a yearly membership fee as well?", "CHARGES"],
    ["The mountain America account still has problems connecting. I don't want to have to reconnect every time I view the app. ", "ACCOUNT_LINKING"],
    ["How much do you typically need to put down for the purchase of a home?", "FINANCIAL_PLANNING"],
    ["do i spend too much on eating out?", "SPENDING"],
    ["What's my balance", "BUDGET"],
    ["Can I afford a 20 dollar gym membership?", "SPENDING"],
    ["So what will I be paying monthly for this app? I purely use it to just withdraw like a savings", "CASH_TRANSFER"],
    ["I would like a refund", "CHARGES"],
    ["Someone stole my phone number and used it for your app. Can you please remove my phone number from whatever account it's linked to?", "APP_GENERAL"],
    ["I put ten dollars from my bank account into my Albert rainy day fund last Friday and it still hasn't cleared yet", "SAVING"],
    ["Ok I had some issues with my bank. Can I cancel that transaction so my account doesn't get overdrafted? My bank has been giving my lots of issues and I'm about to switch banks", "CHARGES"],
    ["My account won't let me enter my address bc it's not on Google", "ACCOUNT_LINKING"],
    ["Is capital one a good credit card ?", "DEBT"],
    ["How can I improve my credit score? I have a 650", "DEBT"],
    ["I need to transfer money back, NOW. ", "CASH_TRANSFER"],
    ["Should I pay my phone bill or get new car insurance? ", "INSURANCE"],
    ["My account all the sudden stopped working. I tried to update my bank credentials and it says \"my account is not authorized for online use. Please setup account.\"  What do I need to do? It's never done this before.", "ACCOUNT_LINKING"],
    ["Can you guys stop taking money out of my account without it going to savings ", "SAVING"],
    ["How much do I have left to spend? ", "SPENDING"],
    ["I need to stop the money transferring into the rainy day and emergency funds. It overdrafted my bank account. ", "CHARGES"],
    ["Why does it keep saying there's an error connecting to my bank when i know I'm entering my information right?", "ACCOUNT_LINKING"],
    ["I can not access the app , I try to reset my password and never get a text or email ", "APP_GENERAL"],
    ["How do I delete my account", "CANCELLATION"],
    ["Can u call me please Hello So y'all took money out of my account when there wasn't enough in it and I got a $35 over draft fee I'm gonna need that back", "CHARGES"],
    ["How can I make an appropriate budget and cut spending? I am in grad Do you have an resources that could help me build one of these, like a", "BUDGET"],
    ["How do I begin saving to buy a house? ", "FINANCIAL_PLANNING"],
    ["What do I do with all the cash in my savings account?", "SAVING"],
    ["What is the best way to pay down debt without putting myself in a bind every month ", "DEBT"],
    ["I want to save enough to move into my own apartment by next fall", "SAVING"],
    ["Hi Albert Genius! My name is Willie and I'm getting started with creating a new organization for eSports. Currently I'm filling the coffers with 50$ a week but I do need the rest of my budget to allow potentially more. Any recommendations on where to cut down? ", "BUDGET"],
    ["How can I quickly repair my credit score ", "DEBT"],
    ["Hi I'd like to cancel my account with Albert ", "CANCELLATION"],
    ["I'm about to quit my job to student teach I have about 3000 in savings and 4000 in tax returns will I be okay for 4 months ", "FINANCIAL_PLANNING"],
    ["How can I take money from my Albert savings account and put it in my Wells Fargo account ", "CASH_TRANSFER"],
    ["I can't connect my bank account ", "ACCOUNT_LINKING"],
    ["What should my weekly budget be? How do I design one?", "BUDGET"],
    ["Hi! Just wanted to check in if this was a mistake. I have Albert set up to withdraw from my main account once a week $100. I see two $100 transactions posted (not pending) on my bank account from Albert dated: 11/26 and one dated: 11/27. There is the posted $100 from 11/26 on my Albert account but I do not see the second one from 11/27. I did not authorize this second $100 transaction. Can you please assist ? ", "CHARGES"],
    ["I'm wondering if u offer services like finding the cheapest plane tickets?", "NOT_SUPPORTED_ADVICE"],
    ["Hey Albert, What are all my subscriptions that I am being charged monthly for? ", "BILLS"],
    ["how much did i spend today", "SPENDING"],
    ["Can you guys check to see if that .06 cents is in the process of being transferred to my bank? It transferred 185 but hasn't the .06 yet ", "CASH_TRANSFER"],
    ["What's the cheapest airline ticket from SAN to SJC in December ", "NOT_SUPPORTED_ADVICE"],
    ["Ok. Are there other things I could possibly cut out or reduce my usage/spending on so I could save money on? How much would I save per month if I cut out all eating out and spent a total of $300 on groceries per month?", "BUDGET"],
    ["Can you tell me how much to spend and what my limit will be for the 2 weeks I get paid? ", "SPENDING"],
    ["can i afford to get an apartment?", "SPENDING"]
]